# Ejercicio de Pandas

Carga las 2 librerias que hemos visto a lo largo del curso junto con su "apodo"

numpy, y pandas

**Coloca tu nombre y matricula** 

Nombre: David Eduardo Gómez Marín

Matricula: 194352

1. Carga las librerias básicas

In [4]:
##### carga las dos librerias usadas (numpy, pandas ) 
import numpy as np
import pandas as pd

El siguiente comando importa un data frame desde un archivo csv de internet

In [5]:
 ventas = pd.read_csv('https://raw.githubusercontent.com/jimmyzac/Estadistica-Aplicada-FCFM-UANL/main/bases_datos/ventas2.csv')

In [6]:
ventas

      Año         Mes  Ventas  Gasto
0    2010       Enero    1056    533
1    2010     Febrero     910    496
2    2010       Marzo    1095    695
3    2010       Abril    1157    599
4    2010        Mayo     969    490
..    ...         ...     ...    ...
163  2023      Agosto    1759   1818
164  2023  Septiembre    2114   2142
165  2023     Octubre    2120   1767
166  2023   Noviembre    2102   1652
167  2023   Diciembre    2166   2192

[168 rows x 4 columns]

En caso de que una cantidad contenga decimales, debe estar redondeada a un decimal

In [7]:
ventas.round(1)

      Año         Mes  Ventas  Gasto
0    2010       Enero    1056    533
1    2010     Febrero     910    496
2    2010       Marzo    1095    695
3    2010       Abril    1157    599
4    2010        Mayo     969    490
..    ...         ...     ...    ...
163  2023      Agosto    1759   1818
164  2023  Septiembre    2114   2142
165  2023     Octubre    2120   1767
166  2023   Noviembre    2102   1652
167  2023   Diciembre    2166   2192

[168 rows x 4 columns]

2. Características del dataframe

In [8]:
#con código de python muestra cuantas filas y columnas tiene el dataframe y como se llaman las columnas
ventas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 168 entries, 0 to 167
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Año     168 non-null    int64
 1   Mes     168 non-null    object
 2   Ventas  168 non-null    int64
 3   Gasto   168 non-null    int64
dtypes: int64(3), object(1)
memory usage: 5.4+ KB

In [9]:
#muestra las primeras 5 filas del dataframe
ventas.head()

    Año      Mes  Ventas  Gasto
0  2010    Enero    1056    533
1  2010  Febrero     910    496
2  2010    Marzo    1095    695
3  2010    Abril    1157    599
4  2010     Mayo     969    490

*ventas es una base de datos que contiene las ventas mensuales de una tienda X para los años 2010-2023*

3. Crea una nueva columna que se llame **Ganancias** y que contenga la diferencia entre ventas-gastos

In [10]:
## escribe aqui el código
ventas['Ganancias'] = ventas['Ventas'] - ventas['Gasto']

4. Encuentra el mes-año con las ganancias más altas

In [11]:
## escribe aqui el código
ventas[ventas['Ganancias'] == ventas['Ganancias'].max()]

     Año     Mes  Ventas  Gasto  Ganancias
91  2017  Agosto    1680   1088        592

5. Calcula e imprime las ventas totales, gastos totales y ganancias totales de  todo el periodo\
Ejemplo de mensaje: **las ventas totales son: 5000**, etc

In [12]:
## escribe aqui el código
ventas_totales = ventas['Ventas'].sum()
gastos_totales = ventas['Gasto'].sum()
Ganancias_totales = ventas['Ganancias'].sum()

print('Las ventas totales son: $', ventas_totales,
'Los gastos totales son: $', gastos_totales,
'Las ganancias totales son: $', Ganancias_totales )

Las ventas totales son: $ 235731 Los gastos totales son: $ 181123 Las ganancias totales son: $ 54608

6. Calcula y muestra las ventas, gastos y ganancias para cada año

In [15]:
## escribe aqui el código
h = ventas.groupby('Año').sum()

h

C:\Users\DELL\AppData\Local\Temp\ipykernel_10552\1256162712.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  h = ventas.groupby('Año').sum()

      Ventas  Gasto  Ganancias
Año
2010   12015   6756       5259
2011   12778   7806       4972
2012   12965   8430       4535
2013   14037   8963       5074
2014   14922  10377       4545
2015   14951  10784       4167
2016   15376  11053       4323
2017   17189  12369       4820
2018   18325  14648       3677
2019   18204  14759       3445
2020   18917  16206       2711
2021   21057  17693       3364
2022   21692  18946       2746
2023   23303  22333        970

7. Calcula y muestra las ventas promedio mensuales del año 2015

In [18]:
## escribe aqui el código
##Pista: primero filtra para el año 2015, luego selecciona la columna ventas 
Promedio_ventas_2015 = h.iloc[5,0]/12

1245.9166666666667

In [19]:
Promedio_ventas_2015

1245.9166666666667

8. Calcula e imprime las ventas totales y ventas promedio para los eneros. Es decir, para enero de 2010, enero de 2011, enero 2012, etc

In [21]:
## escribe aqui el código ventas totales
##Pista: primero filtra los meses de enero, luego selecciona la columna ventas 
Eneros = ventas.query('Mes =="Enero"')
ventas.query('Mes=="Enero"')

      Año    Mes  Ventas  Gasto  Ganancias
0    2010  Enero    1056    533        523
12   2011  Enero    1242    727        515
24   2012  Enero    1162    709        453
36   2013  Enero    1332    824        508
48   2014  Enero    1457   1001        456
60   2015  Enero    1410   1004        406
72   2016  Enero    1299    851        448
84   2017  Enero    1246    818        428
96   2018  Enero    1330   1171        159
108  2019  Enero    1586   1355        231
120  2020  Enero    1576   1332        244
132  2021  Enero    1939   1756        183
144  2022  Enero    1741   1411        330
156  2023  Enero    1697   1330        367

In [26]:
## escribe aqui el código ventas promedio
Eneros['Ventas'].mean()

1433.7857142857142

In [27]:
#Ventas totales
Eneros['Ventas'].sum()

20073

9. Calcula las ventas promedio por mes, y muestra los meses ordenados de menor a mayor según su promedio

In [32]:
## aqui va tu codigo
VentasPromXmes = ventas.groupby('Mes')['Ventas'].mean().reset_index()

VentasPromXmes.sort_values('Ventas', ascending=True)

           Mes       Ventas
6        Junio  1325.714286
11  Septiembre  1347.357143
5        Julio  1363.642857
10     Octubre  1388.285714
7        Marzo  1394.428571
4      Febrero  1406.357143
8         Mayo  1409.714286
2    Diciembre  1416.642857
3        Enero  1433.785714
1       Agosto  1437.857143
9    Noviembre  1456.642857
0        Abril  1457.500000